app/views/reservations/index.html.erb


	<% @rest.reservations.each do |r| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."rest_id" = 7