app/views/reservations/show.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."rest_id" = 5 AND "reservations"."id" = $1 LIMIT 1  [["id", "14"]]
---
  <dt>Name</dt>
  <dd><%= @reservation.name %></dd> <!--Reservation.find(:id) <%= restaurant_reservation_path([@restaurant, @reservation]) %></h1>-->