app/controllers/reservations_controller.rb

SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "7"]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."rest_id" = 7
---
  def index
  	@rest = Rest.find(params[:rest_id])
  	@reservation = @rest.reservations.all

SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "5"]]
---
 def new
 	  @rest = Rest.find(params[:rest_id])

SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "5"]]
INSERT INTO "reservations" ("created_at", "reservation_time", "rest_id", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    rest = Rest.find(params[:rest_id])
    @reservation = rest.reservations.new(params[:reservation])

    if @reservation.save

SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."rest_id" = 5 AND "reservations"."id" = $1 LIMIT 1  [["id", "14"]]
---
 def show
  @rest = Rest.find(params[:rest_id])
  @reservation = @rest.reservations.find(params[:id])