app/controllers/rests_controller.rb

  def index
  	@rests = Rest.all
---
SELECT "rests".* FROM "rests"

  def create
  	@rest = current_owner.rests.new(params[:rest])

  	if @rest.save
---
INSERT INTO "rests" ("address", "created_at", "description", "image", "name", "owner_id", "ownerid", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @rest = Rest.find(params[:id])
    if current_owner == @rest.owner
  	  @rest = Rest.find(params[:id])
---
SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "rest"]]
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1
SELECT "rests".* FROM "rests" WHERE "rests"."owner_id" = 2 AND "rests"."id" = $1 LIMIT 1  [["id", "5"]]

  def show
  	@rest = Rest.find(params[:id])
---
SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "5"]]

  def update
    @rest = Rest.find(params[:id])
    if @rest.update_attributes(params[:rest])
---
SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "rests" SET "description" = 'an awesome vegan place', "address" = '123 Awesome St', "phone" = '111-4444', "updated_at" = '2013-06-26 16:07:57.576314' WHERE "rests"."id" = 8

  def destroy
    @rest = Rest.find(params[:id])
    @rest.destroy
---
SELECT "rests".* FROM "rests" WHERE "rests"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "rests" WHERE "rests"."id" = $1  [["id", 4]]